CSI API ETABS v1

# cLoadCasesStaticNonlinearStaged Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseStaticNonlinearStaged StaticNonlinearStaged { get; }

    ReadOnly Property StaticNonlinearStaged As cCaseStaticNonlinearStaged
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseStaticNonlinearStaged

    value = instance.StaticNonlinearStaged

    property cCaseStaticNonlinearStaged^ StaticNonlinearStaged {
    	cCaseStaticNonlinearStaged^ get ();
    }

    abstract StaticNonlinearStaged : cCaseStaticNonlinearStaged with get

#### Property Value

Type: cCaseStaticNonlinearStaged

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com